// const arr = [16,-37,54,-4,72,-56,47,4,-16,25,-37,46,4,-51,-207,-63,4,-54,76,-4,12,-35,4,47];
const arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, -5];

// 2======================================================================================================================================================

// let minMumber = arr[0]; // зберігаємо поточний мінімальний елемент
// let minMumberIndex = 0; // зберігаємо порядковий номер поточного мінімального елемента

// for(let i = 1; i < arr.length; i++) { // проходимо по масиву
//   if(arr[i] < minMumber) { // якщо поточний елемент менше мінімального
//     minMumber = arr[i]; // оновлюємо мінімальний елемент
//     minMumberIndex = i; // оновлюємо порядковий номер мінімального елемента
//   }
// }
// console.log("Мінімальний елемент:", minMumber); // виводимо мінімальний елемент
// console.log("Порядковий номер мінімального елемента:", minMumberIndex); // виводимо порядковий номер мінімального елемента

// // 3======================================================================================================================================================

// let maxMumber = arr[0]; // зберігаємо поточний мінімальний елемент
// let maxMumberIndex = 0; // зберігаємо порядковий номер поточного мінімального елемента

// for(let i = 1; i < arr.length; i++) { // проходимо по масиву
//   if(arr[i] > maxMumber) { // якщо поточний елемент більше мінімального
//     maxMumber = arr[i]; // оновлюємо максимальний елемент
//     maxMumberIndex = i; // оновлюємо порядковий номер максимального елемента
//   }
// }
// console.log("Максимальний елемент:", maxMumber); // виводимо мінімальний елемент
// console.log("Порядковий номер максимального елемента:", maxMumberIndex); // виводимо порядковий номер мінімального елемента

// 4======================================================================================================================================================

// let counterNegativeNumbers = 0;

// for (let i = 0; i < arr.length; i++) { // Проходимось по кожному елементу масиву
//   if (arr[i] < 0) { // Перевіряємо, чи є елемент від'ємним
//     counterNegativeNumbers++; // Якщо елемент від'ємний, збільшуємо лічильник на 1
//   }
// }
// console.log("Кількість негативних елементів:", counterNegativeNumbers);

// 5======================================================================================================================================================

// let counter = 0;

// for (let i = 0; i < arr.length; i++) { // Проходимось по кожному елементу масиву
//   if (arr[i] > 0 && arr[i] % 2 !== 0) { // Перевіряємо, чи є елемент додатнім та не парним
//     counter++; // Якщо елемент від'ємний, збільшуємо лічильник на 1
//   }
// }
// console.log("Кількість негативних елементів:", counter);

// 6======================================================================================================================================================

// let counter = 0;

// for (let i = 0; i < arr.length; i++) { // Проходимось по кожному елементу масиву
//   if (arr[i] > 0 && arr[i] % 2 === 0) { // Перевіряємо, чи є елемент додатнім та парним
//     counter++; // Якщо елемент від'ємний, збільшуємо лічильник на 1
//   }
// }
// console.log("Кількість негативних елементів:", counter);

// 7======================================================================================================================================================

// let sum = 0;
// for (let i = 0; i < arr.length; i++) { // Проходимось по кожному елементу масиву
//   if (arr[i] > 0 && arr[i] % 2 === 0) {  // Перевіряємо, чи є елемент додатнім та парним
//     sum += arr[i]; // Сумуємо елементи 
//   }
// }
// console.log("Кількість негативних елементів:", sum);

// 8======================================================================================================================================================

// let sum = 0;
// for (let i = 0; i < arr.length; i++) { // Проходимось по кожному елементу масиву
//   if (arr[i] > 0 && arr[i] % 2 !== 0) {  // Перевіряємо, чи є елемент додатнім та не парним
//     sum += arr[i]; // Сумуємо елементи 
//   }
// }
// console.log("Кількість негативних елементів:", sum);

// 9======================================================================================================================================================

// let sum = 1;
// for (let i = 0; i < arr.length; i++) { // Проходимось по кожному елементу масиву
//   if (arr[i] > 0) {  // Перевіряємо, чи є елемент додатнім
//     sum *= arr[i]; // Множимо елементи 
//   }
// }
// console.log("Кількість негативних елементів:", sum);

// 10======================================================================================================================================================

let max = arr[0];
for (let i = 1; i < arr.length; i++) {
  if (arr[i] > max) {
    max = arr[i];
  }
}
console.log("Кількість негативних елементів:", max);
