// Оголошуємо клас Людина
class Human {
  // Конструктор, який приймає два параметри: імʼя та стать.
  constructor(name, gender) {
    this.name = name; // Властивість name, яку отримуємо через параметр name
    this.gender = gender; // Властивість gender, яку отримуємо через параметр gender
  }
}
// Цей код (вище) оголошує клас Human з двома властивостями - name та gender. Конструктор класу приймає два параметри - name та gender - 
// і встановлює їх як властивості екземпляру класу за допомогою this.name = name та this.gender = gender.


// Оголошуємо клас Квартира
class Apartment {
  constructor() {
    this.residents = [];
  }
  // Властивість масиву жителів, який при створенні пустий
  residents = [];

  // Метод додавання жителя - приймає екземпляр класу Людина, та додає до масиву жителів.
  addResident(resident) {
    this.residents.push(resident); // Додаємо жителя до масиву residents за допомогою методу push
  }
}
// Цей код (вище) оголошує клас Apartment з однією властивістю - масивом residents, який при створенні є порожнім. Клас також має метод addResident(), 
// який приймає екземпляр класу Human і додає його до масиву residents за допомогою методу push().


class House {
  constructor(maxApartments) {
    this.apartments = [];
    this.maxApartments = maxApartments;
  }

  addApartment(apartment) {
    if (this.apartments.length < this.maxApartments) {
      this.apartments.push(apartment);
    } else {
      console.log("Більше квартир до будинку додати неможливо.");
    }
  }
}
// Цей код визначає клас House, який має дві властивості: apartments - масив, що містить усі квартири будинку, та maxApartments - максимальна кількість квартир, яку може мати будинок.
// Конструктор класу House приймає один параметр - максимальну кількість квартир і ініціалізує відповідну властивість. Метод addApartment(apartment) додає нову квартиру до масиву 
// apartments, якщо кількість квартир у будинку ще не досягла максимальної кількості (maxApartments). Якщо кількість квартир вже досягла максимальної, метод виводить повідомлення 
// в консоль про те, що більше квартир до будинку додати неможливо.У цілому, цей код створює клас House з методом для додавання нових квартир у будинок.


// Створення екземплярів класу Human
const john = new Human("John", "male"); //створюємо змінну john, в яку зберігаємо новий екземпляр класу Human. Конструктор класу приймає два аргументи - 
// ім'я та стать, тому ми передаємо їх як параметри - "John" та "male".
const mary = new Human("Mary", "female");// аналогічно до попереднього рядка, створюємо змінну mary, в яку зберігаємо новий екземпляр класу Human, передаючи йому параметри "Mary" 
//та "female".
const den = new Human("Den", "male");

// Створення екземплярів класу Apartment
const apartment1 = new Apartment();//створюємо змінну apartment1, в яку зберігаємо новий екземпляр класу Apartment. Конструктор класу Apartment не має аргументів, 
//тому ми не передаємо жодних параметрів.
const apartment2 = new Apartment();//аналогічно до попереднього рядка, створюємо змінну apartment2, в яку зберігаємо новий екземпляр класу Apartment.
const apartment3 = new Apartment();

// Додавання людей до квартир
apartment1.addResident(john);//викликаємо метод addResident для екземпляру apartment1 класу Apartment, передаючи йому змінну john як параметр. Метод додає людину до масиву 
//жителів квартири.
apartment2.addResident(mary);//аналогічно до попереднього рядка, викликаємо метод addResident для екземпляру apartment2 класу Apartment, передаючи йому змінну mary 
//як параметр. Метод додає людину до масиву жителів квартири.
apartment2.addResident(den);

// Створення екземпляру класу House
const house = new House(3);//створюємо змінну house, в яку зберігаємо новий екземпляр класу House. Конструктор класу приймає один аргумент - 
//максимальну кількість квартир в будинку, тому ми передаємо значення 2.

// Додавання квартир до будинку
house.addApartment(apartment1);
house.addApartment(apartment2);
house.addApartment(apartment3);

console.log(house);
//                            Додавання людей до квартир
// Викликається метод addResident у екземплярі apartment1 класу Apartment, передаючи йому екземпляр john класу Human як аргумент.
// Метод addResident класу Apartment додає переданого жителя до масиву residents відповідної квартири.
// Потім аналогічно до apartment2 додається екземпляр mary до apartment2.
//                         Створення екземпляру класу House
// Створюється новий екземпляр класу House з переданим аргументом 2 в конструктор.
// Цей екземпляр зберігається в змінній house.
//                          Додавання квартир до будинку
// Викликається метод addApartment у екземплярі house класу House, передаючи йому екземпляр apartment1 класу Apartment як аргумент.
// Метод addApartment класу House перевіряє, чи кількість квартир у будинку не перевищує максимальну кількість, яку передали при створенні об'єкту house. У цьому 
// випадку, якщо кількість квартир менша за максимальну, метод додає передану квартиру до масиву apartments екземпляру house. В іншому випадку виводиться повідомлення 
// у консоль про те, що неможливо додати більше квартир до будинку.
// Потім аналогічно до apartment1 додається apartment2.

